In [1]:
import pandas as pd
import sqlite3

In [2]:
def rsql(query):
    return pd.read_sql_query(query, conn)

In [3]:
#collect screener data as a data frame
imf_data = pd.read_html('https://www.imf.org/en/Publications/WEO/weo-database/2025/april/weo-report?c=513,514,516,522,924,819,534,536,826,544,548,556,867,868,948,518,836,558,565,853,566,862,813,524,578,537,866,869,846,582,&s=NGDPD,&sy=2020&ey=2025&ssm=0&scsm=1&scc=0&ssd=1&ssc=0&sic=0&sort=country&ds=.&br=1')
type(imf_data)

list

In [4]:
# number of tables
len(imf_data)

1

In [5]:
type(imf_data[0])

pandas.core.frame.DataFrame

In [6]:
imfdf = imf_data[0]
imfdf.head(3)

,Country,Subject Descriptor,Units,Scale,Country/Series-specific Notes,2020,2021,2022,2023,2024,2025
0,Bangladesh,"Gross domestic product, current prices",U.S. dollars,Billions,NaN,373.902,416.265,460.201,451.534,451.096,467.218
1,Bhutan,"Gross domestic product, current prices",U.S. dollars,Billions,NaN,2.586,2.623,2.869,2.923,3.092,3.422
2,Brunei Darussalam,"Gross domestic product, current prices",U.S. dollars,Billions,NaN,12.006,14.006,16.682,15.095,15.463,16.007

In [7]:
conn = sqlite3.connect("imf.db")
c = conn.cursor()

In [8]:
imfdf.columns

Index(['Country', 'Subject Descriptor', 'Units', 'Scale',
       'Country/Series-specific Notes', '2020', '2021', '2022', '2023', '2024',
       '2025'],
      dtype='object')

In [9]:
c.execute(
    """ CREATE TABLE IF NOT EXISTS imfdata(
   'Country' text, 'Subject Descriptor' text, 'Units' text, 'Scale' text,
       'Country/Series-specific Notes' text, '2020' float, '2021' float, '2022' float, '2023' float, '2024' float,
       '2025' float);""")

In [10]:
imfdf.to_sql("imfdata",conn, if_exists = "replace", index = False)

30

#### View the entire table

In [11]:
rsql("SELECT * FROM imfdata")

,Country,Subject Descriptor,Units,Scale,Country/Series-specific Notes,2020,2021,2022,2023,2024,2025
0,Bangladesh,"Gross domestic product, current prices",U.S. dollars,Billions,None,373.902,416.265,460.201,451.534,451.096,467.218
1,Bhutan,"Gross domestic product, current prices",U.S. dollars,Billions,None,2.586,2.623,2.869,2.923,3.092,3.422
2,Brunei Darussalam,"Gross domestic product, current prices",U.S. dollars,Billions,None,12.006,14.006,16.682,15.095,15.463,16.007
3,Cambodia,"Gross domestic product, current prices",U.S. dollars,Billions,None,34.898,36.797,39.838,43.304,47.328,49.799
4,China,"Gross domestic product, current prices",U.S. dollars,Billions,None,15103.357,18190.803,18307.816,18270.351,18748.009,19231.705
5,Fiji,"Gross domestic product, current prices",U.S. dollars,Billions,None,4.432,4.305,4.970,5.442,5.949,6.257
6,India,"Gross domestic product, current prices",U.S. dollars,Billions,None,2674.852,3167.271,3346.107,3638.490,3909.097,4187.017
7,Indonesia,"Gross domestic product, current prices",U.S. dollars,Billions,None,1059.055,1186.510,1319.101,1371.169,1396.300,1429.743
8,Kiribati,"Gross domestic product, current prices",U.S. dollars,Billions,None,0.222,0.285,0.271,0.289,0.308,0.312
9,Lao P.D.R.,"Gross domestic product, current prices",U.S. dollars,Billions,None,18.511,18.533,15.121,14.978,15.879,16.322
10,Malaysia,"Gross domestic product, current prices",U.S. dollars,Billions,None,337.456,373.785,407.605,399.705,419.617,444.984
11,Maldives,"Gross domestic product, current prices",U.S. dollars,Billions,None,3.706,5.242,6.168,6.581,7.019,7.480
12,Marshall Islands,"Gross domestic product, current prices",U.S. dollars,Billions,None,0.242,0.259,0.253,0.259,0.280,0.297
13,Micronesia,"Gross domestic product, current prices",U.S. dollars,Billions,None,0.373,0.392,0.416,0.444,0.471,0.500
14,Mongolia,"Gross domestic product, current prices",U.S. dollars,Billions,None,13.313,15.286,17.146,20.315,23.586,25.804
15,Myanmar,"Gross domestic product, current prices",U.S. dollars,Billions,None,65.631,58.264,61.723,61.466,61.176,64.944
16,Nauru,"Gross domestic product, current prices",U.S. dollars,Billions,None,0.125,0.176,0.152,0.152,0.161,0.169
17,Nepal,"Gross domestic product, current prices",U.S. dollars,Billions,None,33.434,36.927,41.183,40.907,43.419,46.080
18,Palau,"Gross domestic product, current prices",U.S. dollars,Billions,None,0.259,0.236,0.248,0.275,0.306,0.333
19,Papua New Guinea,"Gross domestic product, current prices",U.S. dollars,Billions,None,23.848,26.113,31.653,30.729,31.654,32.835
20,Philippines,"Gross domestic product, current prices",U.S. dollars,Billions,None,361.751,394.087,404.353,437.055,461.617,497.495
21,Samoa,"Gross domestic product, current prices",U.S. dollars,Billions,None,0.869,0.844,0.833,0.938,1.068,1.160
22,Solomon Islands,"Gross domestic product, current prices",U.S. dollars,Billions,None,1.536,1.523,1.566,1.661,1.777,1.898
23,Sri Lanka,"Gross domestic product, current prices",U.S. dollars,Billions,None,84.304,88.609,74.584,83.723,98.964,NaN
24,Thailand,"Gross domestic product, current prices",U.S. dollars,Billions,None,500.462,506.195,495.645,515.906,526.411,546.224
25,Timor-Leste,"Gross domestic product, current prices",U.S. dollars,Billions,None,2.163,3.625,3.209,2.080,2.015,2.115
26,Tonga,"Gross domestic product, current prices",U.S. dollars,Billions,None,0.503,0.520,0.515,0.512,0.539,0.568
27,Tuvalu,"Gross domestic product, current prices",U.S. dollars,Billions,None,0.052,0.062,0.061,0.063,0.065,0.065
28,Vanuatu,"Gross domestic product, current prices",U.S. dollars,Billions,None,1.008,0.921,1.072,1.158,1.206,1.267
29,Vietnam,"Gross domestic product, current prices",U.S. dollars,Billions,None,346.310,370.076,411.068,433.008,459.472,490.970

#### What is the GDP of India?

In [12]:
rsql("SELECT * FROM imfdata WHERE Country = 'India'")

,Country,Subject Descriptor,Units,Scale,Country/Series-specific Notes,2020,2021,2022,2023,2024,2025
0,India,"Gross domestic product, current prices",U.S. dollars,Billions,None,2674.852,3167.271,3346.107,3638.49,3909.097,4187.017

#### Total of all GDP

In [13]:
rsql("SELECT Country, SUM([2020] + [2021] + [2022] + [2023] + [2024] + [2025]) AS total_all_years FROM imfdata GROUP BY Country")

              Country  total_all_years
0          Bangladesh         2620.216
1              Bhutan           17.515
2   Brunei Darussalam           89.259
3            Cambodia          251.964
4               China       107852.041
5                Fiji           31.355
6               India        20922.834
7           Indonesia         7761.878
8            Kiribati            1.687
9          Lao P.D.R.           99.344
10           Malaysia         2383.152
11           Maldives           36.196
12   Marshall Islands            1.590
13         Micronesia            2.596
14           Mongolia          115.450
15            Myanmar          373.204
16              Nauru            0.935
17              Nepal          241.950
18              Palau            1.657
19   Papua New Guinea          176.832
20        Philippines         2556.358
21              Samoa            5.712
22    Solomon Islands            9.961
23          Sri Lanka              NaN
24           Thailand         3090.843
25        Timor-Leste           15.207
26              Tonga            3.157
27             Tuvalu            0.368
28            Vanuatu            6.632
29            Vietnam         2510.904

#### Average of last 5 years' GDP grouped by the country

In [14]:
rsql(" SELECT Country, AVG(([2020] + [2021] + [2022] + [2023] + [2024] + [2025]) / 6.0) AS avg_all_years FROM imfdata GROUP BY Country")

              Country  avg_all_years
0          Bangladesh     436.702667
1              Bhutan       2.919167
2   Brunei Darussalam      14.876500
3            Cambodia      41.994000
4               China   17975.340167
5                Fiji       5.225833
6               India    3487.139000
7           Indonesia    1293.646333
8            Kiribati       0.281167
9          Lao P.D.R.      16.557333
10           Malaysia     397.192000
11           Maldives       6.032667
12   Marshall Islands       0.265000
13         Micronesia       0.432667
14           Mongolia      19.241667
15            Myanmar      62.200667
16              Nauru       0.155833
17              Nepal      40.325000
18              Palau       0.276167
19   Papua New Guinea      29.472000
20        Philippines     426.059667
21              Samoa       0.952000
22    Solomon Islands       1.660167
23          Sri Lanka            NaN
24           Thailand     515.140500
25        Timor-Leste       2.534500
26              Tonga       0.526167
27             Tuvalu       0.061333
28            Vanuatu       1.105333
29            Vietnam     418.484000

#### Top 5 countries with the highest GDP in 2025

In [15]:
rsql("SELECT Country, [2025] AS GDP_usd_billion FROM imfdata ORDER BY [2025] DESC LIMIT 5")

       Country  GDP_usd_billion
0        China        19231.705
1        India         4187.017
2    Indonesia         1429.743
3     Thailand          546.224
4  Philippines          497.495

#### View the first 3 records

In [16]:
rsql("SELECT * FROM imfdata LIMIT 3")

,Country,Subject Descriptor,Units,Scale,Country/Series-specific Notes,2020,2021,2022,2023,2024,2025
0,Bangladesh,"Gross domestic product, current prices",U.S. dollars,Billions,None,373.902,416.265,460.201,451.534,451.096,467.218
1,Bhutan,"Gross domestic product, current prices",U.S. dollars,Billions,None,2.586,2.623,2.869,2.923,3.092,3.422
2,Brunei Darussalam,"Gross domestic product, current prices",U.S. dollars,Billions,None,12.006,14.006,16.682,15.095,15.463,16.007

#### Rename columns

In [17]:
rsql("SELECT Country AS Country_Name, [2025] AS GDP_in_2025 FROM imfdata LIMIT 5")

        Country_Name  GDP_in_2025
0         Bangladesh      467.218
1             Bhutan        3.422
2  Brunei Darussalam       16.007
3           Cambodia       49.799
4              China    19231.705

#### Top Countries with GDP Over $1000B in 2025

In [18]:
rsql("SELECT Country, [2025] AS GDP FROM imfdata WHERE [2025] > 1000 ORDER BY [2025] DESC")

     Country        GDP
0      China  19231.705
1      India   4187.017
2  Indonesia   1429.743

#### Countries with average GDP (2020 to 2025) > $250B

In [19]:
rsql("SELECT Country, AVG([2020] + [2021] + [2022] + [2023] + [2024] + [2025]) / 6 AS avg_GDP FROM imfdata GROUP BY Country HAVING avg_gdp > 250 ORDER BY avg_GDP DESC")

       Country       avg_GDP
0        China  17975.340167
1        India   3487.139000
2    Indonesia   1293.646333
3     Thailand    515.140500
4   Bangladesh    436.702667
5  Philippines    426.059667
6      Vietnam    418.484000
7     Malaysia    397.192000

#### Countries with 2025 GDP Between 1,000 and 10,000 Billion USD

In [20]:
rsql("SELECT Country, [2025] AS GDP_2025 FROM imfdata WHERE [2025] BETWEEN 1000 AND 10000 ORDER BY [2025] DESC")

     Country  GDP_2025
0      India  4187.017
1  Indonesia  1429.743

#### GDP Aggregates

In [21]:
rsql("SELECT COUNT(*) AS total_entries, AVG([2025]) AS avg_gdp_2025, SUM([2025]) AS total_gdp_2025 FROM imfdata")

   total_entries  avg_gdp_2025  total_gdp_2025
0             30    950.792759        27572.99

#### Unique units used in the dataset

In [22]:
rsql("SELECT DISTINCT Units FROM imfdata")

          Units
0  U.S. dollars

#### Adjust a GDP value

In [23]:
c.execute("UPDATE imfdata SET [2020] = 2675 WHERE Country = 'India'")
conn.commit()

In [24]:
rsql("SELECT [2020] FROM imfdata WHERE Country = 'India'")

     2020
0  2675.0

#### Inserting a tuple

In [25]:
c.execute("""
INSERT INTO imfdata 
(Country, [Subject Descriptor], Units, Scale, [Country/Series-specific Notes], [2020], [2021], [2022], [2023], [2024], [2025]) 
VALUES 
('New_Country', 'Gross domestic product, current prices', 'U.S. dollars', 'Billions', NULL, 100.0, 120.5, 140.0, 160.0, 180.0, 200.0)
""")
conn.commit()

In [26]:
rsql("SELECT * FROM imfdata WHERE Country = 'New_Country'")

,Country,Subject Descriptor,Units,Scale,Country/Series-specific Notes,2020,2021,2022,2023,2024,2025
0,New_Country,"Gross domestic product, current prices",U.S. dollars,Billions,None,100.0,120.5,140.0,160.0,180.0,200.0

#### All countries with names starting with "B"

In [27]:
rsql("SELECT Country, [2025] FROM imfdata WHERE Country LIKE 'B%'")

             Country     2025
0         Bangladesh  467.218
1             Bhutan    3.422
2  Brunei Darussalam   16.007